[
    {
        "id": "engineering_devops_architecture_h2h_h2h-docs-and-faqs_convert-ppk-files-to-ssh-rsa-format-chunk-0",
        "name": "Convert ppk files to ssh-rsa format.txt - .ppk files are generated by puTTYgen and contain information about key file authentication",
        "breadcrumb": [
            "Engineering",
            "DevOps",
            "Architecture",
            "H2H",
            "H2H Docs and FAQs"
        ],
        "description": "This section explains how to convert PuTTY private key (.ppk) files, which are generated by the PuTTYgen tool and contain both public and private key information, into the OpenSSH format (.ssh-rsa) that is more widely used. It provides two methods: one involves extracting the public key from the .ppk file and converting it using the ssh-keygen command, while the other suggests installing the PuTTYgen tool on macOS using Homebrew.",
        "use_cases": [
            "Converting PuTTY private key (.ppk) files to OpenSSH format (.ssh-rsa)",
            "Using converted keys for secure file transfer with SFTP clients like FileZilla or WinSCP",
            "Enabling key-based authentication for SSH connections",
            "Simplifying key management by using a widely-adopted format like OpenSSH"
        ],
        "capabilities": [
            "Extracting public key from .ppk file",
            "Converting public key to .ssh-rsa format",
            "Installing PuTTYgen tool on macOS",
            "Generating OpenSSH-compatible keys",
            "Enabling key-based authentication",
            "Facilitating secure file transfers"
        ],
        "references": []
    },
    {
        "id": "engineering_devops_architecture_h2h_h2h-docs-and-faqs_convert-ppk-files-to-ssh-rsa-format-chunk-1",
        "name": "Convert ppk files to ssh-rsa format.txt - An easier alternative is to instally puttygen and run these instead:-",
        "breadcrumb": [
            "Engineering",
            "DevOps",
            "Architecture",
            "H2H",
            "H2H Docs and FAQs"
        ],
        "description": "This section provides an alternative and easier method to convert PuTTY private key (.ppk) files to the OpenSSH format (.ssh-rsa) using the PuTTYgen tool. The first command converts the .ppk file to a private key in OpenSSH format, while the second command converts it to a public key in OpenSSH format. This conversion allows the use of PuTTY-generated keys with other SSH clients or services that support the OpenSSH key format.",
        "use_cases": [
            "Converting PuTTY private keys to OpenSSH format",
            "Using PuTTY-generated keys with other SSH clients or services",
            "Migrating from PuTTY to OpenSSH-based tools",
            "Consolidating multiple key formats into a single format"
        ],
        "capabilities": [
            "ppk to ssh-rsa conversion",
            "private key conversion",
            "public key conversion",
            "command-line tool",
            "puttygen utility"
        ],
        "references": []
    },
    {
        "id": "engineering_devops_architecture_h2h_h2h-docs-and-faqs_convert-ppk-files-to-ssh-rsa-format-chunk-2",
        "name": "Convert ppk files to ssh-rsa format.txt - :::tip",
        "breadcrumb": [
            "Engineering",
            "DevOps",
            "Architecture",
            "H2H",
            "H2H Docs and FAQs"
        ],
        "description": "This section explains the different output formats that can be specified using the '-O' option when converting PuTTY private key (PPK) files to other formats. It lists various output types such as private key formats for PuTTY, OpenSSH, and SSH.com, as well as public key formats like RFC 4716, OpenSSH, and fingerprint output. This information is useful for users who need to convert their PPK files to different key formats for compatibility with various systems or applications.",
        "use_cases": [
            "Converting PuTTY private keys (PPK) to OpenSSH private key format",
            "Exporting PuTTY private keys to SSH.com private key format",
            "Generating public keys from PuTTY private keys in OpenSSH or RFC 4716 format",
            "Obtaining the fingerprint of a PuTTY private key"
        ],
        "capabilities": [
            "Private key conversion",
            "Public key generation",
            "Key fingerprint output",
            "PuTTY private key format",
            "OpenSSH private key format",
            "SSH.com private key format",
            "RFC 4716 public key format",
            "OpenSSH public key format"
        ],
        "references": [
            "http://ssh.com",
            "http://ssh.com"
        ]
    }
]